In [1]:
import pandas as pd

In [3]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

type(items)

dict

In [5]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [12]:
data = {
        'Bob': pd.Series([245, 25, 55]), 
        'Alice': pd.Series([40, 110, 500, 45])
}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [15]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [16]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [17]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [18]:
shopping_carts.shape

(5, 2)

In [19]:
shopping_carts.ndim

2

In [20]:
shopping_carts.size

10

In [22]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [23]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [24]:
alice_shopping_cart = pd.DataFrame(items, columns=['Alice'])
alice_shopping_cart

         Alice
book        40
glasses    110
bike       500
pants       45

In [25]:
alice_sel_shopping_cart = pd.DataFrame(items, columns=['Alice'], index=['book', 'glasses'])
alice_sel_shopping_cart

         Alice
book        40
glasses    110

In [27]:
data = {'Integers': [1, 2, 3], 'Floats': [4.5, 8.2, 9.6]}
df = pd.DataFrame(data, index=['Label 1', 'Label 2', 'Label 3'])
df

         Integers  Floats
Label 1         1     4.5
Label 2         2     8.2
Label 3         3     9.6

In [43]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

store_items = pd.DataFrame(items2, index=['Store 1', 'Store 2'])

store_items

         bikes  pants  watches  glasses
Store 1     20     30       35      NaN
Store 2     15      5       10     50.0

In [31]:
print('How many bikes are in each store:\n', store_items[['bikes']])
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print('What items are in Store 1:\n', store_items.loc[['Store 1']])
print('How many bikes are in Store 2:', store_items['bikes']['Store 2'])

How many bikes are in each store:
          bikes
Store 1     20
Store 2     15
How many bikes and pants are in each store:
          bikes  pants
Store 1     20     30
Store 2     15      5
What items are in Store 1:
          bikes  pants  watches  glasses
Store 1     20     30       35      NaN
How many bikes are in Store 2: 15

In [44]:
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
Store 1     20     30       35      NaN      15
Store 2     15      5       10     50.0       2

In [45]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  pants  watches  glasses  shirts  suits
Store 1     20     30       35      NaN      15     45
Store 2     15      5       10     50.0       2      7

In [46]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index=['Store 3'])
new_store

         bikes  pants  watches  glasses
Store 3     20     30       35        4

In [71]:
store_items = store_items.append(new_store)
store_items

         bikes  glasses  new_watches  pants  shirts  suits  watches
Store 1     20      NaN         35.0     30    15.0   45.0       35
Store 2     15     50.0         10.0      5     2.0    7.0       10
Store 3     20      4.0          NaN     30     NaN    NaN       35

In [70]:
store_items.drop('Store 3', inplace=True)
store_items

KeyError: "['Store 3'] not found in axis"

In [73]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  new_watches  pants  shirts  suits  watches
Store 1     20      NaN          NaN     30    15.0   45.0       35
Store 2     15     50.0         10.0      5     2.0    7.0       10
Store 3     20      4.0         35.0     30     NaN    NaN       35

In [78]:
store_items.insert(5, 'shoes', [8, 5, 0])
#store_items.pop('shoes')
store_items

         bikes  glasses  new_watches  pants  shirts  shoes  suits  watches
Store 1     20      NaN          NaN     30    15.0      8   45.0       35
Store 2     15     50.0         10.0      5     2.0      5    7.0       10
Store 3     20      4.0         35.0     30     NaN      0    NaN       35

In [79]:
store_items.pop('new_watches')
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1     20      NaN     30    15.0      8   45.0       35
Store 2     15     50.0      5     2.0      5    7.0       10
Store 3     20      4.0     30     NaN      0    NaN       35

In [80]:
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

         bikes  glasses  pants  shirts  suits
Store 1     20      NaN     30    15.0   45.0
Store 2     15     50.0      5     2.0    7.0
Store 3     20      4.0     30     NaN    NaN

In [82]:
store_items = store_items.drop(['Store 1', 'Store 2'], axis=0)
store_items

         hats  glasses  pants  Shirts  suits
Store 3    20      4.0     30     NaN    NaN

In [83]:
store_items = store_items.rename(columns={'bikes': 'hats', 'shirts': 'Shirts'})
store_items

         hats  glasses  pants  Shirts  suits
Store 3    20      4.0     30     NaN    NaN

In [85]:
store_items = store_items.rename(index={'Store 3': 'The Final Store'})
store_items

                 hats  glasses  pants  Shirts  suits
The Final Store    20      4.0     30     NaN    NaN

In [86]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  Shirts  suits
pants
30       20      4.0     NaN    NaN